namespace Zakup.WebHost.Constants;

public static class MessageTemplate
{
    public const string Welcome =  "🌟 *Добро пожаловать в наш робот для закупов!* 🌟\n\n" +
                                   
                                   "Что вы сможете делать?\n" +
                                   "🚀 Создавать рекламный пост *прямо в диалоге с человеком*\n" +
                                   "🔎 Получать *детальный анализ* входящего трафика\n" +
                                   "💎 Определять *источники* ваших лидов\n" +
                                   "🤖 *Автоматически* одобрять заявки в канал\n" +
                                   "🔥* И многое другое!*\n\n" +
                                   "Чтобы начать работу:\n" +

                                   "1️⃣ *Добавьте бота администратором в свой канал с правом на добавление участников.*\n" +
                                   "2️⃣ *Перешлите любой пост из канала в этот чат – так мы удостоверимся, что всё готово.*\n\n" +

                                   "🎯 Добавьте ваш первый креатив и выведите свои рекламные кампании на новый уровень! 🔥\n\n" +
                                   "📚 Если у вас возникнут вопросы, *обязательно загляните в раздел «Помощь»* – там вы найдёте подробные инструкции. А если потребуется дополнительная поддержка, *смело обращайтесь к @gandalftg*.";


    private const string Menu = "*🤖 Добро пожаловать!*\n" +
                                "За сегодня *создано закупов* на сумму *{0}* / *Оплачено* на *{1}*\n\n" +
                                "🟢 Подписалось* на все ваши каналы за сегодня:{2}\n\n" +
                                "🔴 Отписалось* со всех ваших каналов за сегодня: {3}";

    public const string CreateFirstPostRequest = "Вы хотите добавить первый рекламный пост для вашего канала?";
    public const string AutoApproveAcctuallyEnabled = "Автоприём заявок уже включен!";

    public const string WriteAutoApproveMinutes =
        "Введите, через сколько минут нужно автоматически принимать заявки на вступление в канал";

    public const string InvalidApproveTimeError = "Пожалуйста, введите корректное число минут (положительное целое число).";
    public const string LabelChanged = "Метка успешно изменена";
    public const string ChannelAdmins = "Ваши администраторы:";
    public const string AdminNotFound = "Администратор не найден.";
    public const string AdminRemoved = "Администратор удалён";
    public const string ChooseZakupChannel = "Выберите канал для закупа:";
    public const string ChannelsLimitError = "Вы достигли лимита каналов. Удалите какой-нибудь или обратитесь к администратору для повышения привилегий";
    public const string ChooseZakupDate = "📅Введите планируемую дату выхода поста (в формате дд.мм.гггг ЧЧ:ММ) по Москве.";
    public const string AddZakupPrice = "💸Введите цену (число)";
    public const string PublicChannelNotification = "🤔Ваш канал публичный. Сделайте его приватным, чтобы появилась возможность создавать ссылки со вступлением по заявке.";
    public const string ChooseLinkType = "Выберите тип публичности ссылки:";
    public const string ZakupChannelAlias = "Перешлите пост из канала, где вас опубликуют, или напишите источник трафика так, *чтобы Вам было понятно*";
    public const string BadZakupChannelAlias = "❌Перешлите сообщение из площадки размещения или напишите название платформы до 60 символов";
    public const string BadZakupDateError = "Не удалось прочитать дату и время, проверьте форматирование и попробуйте снова. (дд.мм.гггг ЧЧ:ММ) по Москве";

    public const string AddAdminRequest =
        "Пожалуйста, перешлите сообщение от пользователя, которого вы хотите добавить в качестве администратора.";

    public const string AdminForwardEmptyError =
        "Пожалуйста, перешлите сообщение от пользователя, которого вы хотите добавить в качестве администратора.";

    public const string IsAlreadyAdmin = "Пользователь уже является администратором этого канала.";
    public const string AdminCreated = "Пользователь успешно добавлен в качестве администратора.";
    public const string ZakupActions = "Выберите действие для закупа:";
    public static string PriceSaved = "Цена сохранена";
    public const string ChannelDeleted = "Канал удалён";
    public const string DeleteChannelAlert = "Вы уверены? Канал, вся статистика и все креативы будут удалены, остановится обработка вступлений." +
                                             "\n" +
                                             "Поиск пользователя по юзернейму останется доступным";

    public static string GetMenu(decimal zakupPrice = 0, decimal payedPrice = 0, long subscriptions = 0,
        long unsubscriptions = 0)
    {
        return string.Format(Menu, zakupPrice, payedPrice, subscriptions, unsubscriptions);
    }

    public const string ChannelList = "Список каналов:";

    public const string AddChannelRequest =
        "Добавьте бота в ваш канал как администратора (с правом на приглашение участников), а *затем перешлите сообщение из него в этот чат*";
    
    public static string ChannelCreatedMessage(string alias) => $"Канал уже добавлен! Теперь вы можете приступить к работе с ним. Метка канала: {alias}";

    public static string ChannelRestoredMessage(string alias) => $"Канал восстановлен! Метка: {alias}";

    public const string ChannelRestoredNeedAlias = "Канал восстановлен! Теперь введите метку (одно слово)";

    public const string AddChannelAliasRequest = "Теперь напишите метку канала (любое одно слово)";

    public const string ChannelAliasStateNotification = "Метка должна быть одним словом и не длиннее 15 символов. Пожалуйста, введите снова.";

    public const string FirstPostDecline = "**Без проблем\\!** вы всегда сможете сделать это через меню канала";
    public const string CreativeInstructionText = "⚛️ Установка креатива" +
                                                  "\nОтправьте или перешлите мне рекламный пост." +
                                                  "\nМожно прикрепить фотографии/гифки/видео." +
                                                  "\nДля будущей генерации постов в нём должны быть ссылки, при создании закупа бот автоматически заменит их на новые." +
                                                  "\nСсылки вида @channel бот скрытно делает уникальными" +
                                                  "\nИли напишите /cancel для отмены";

    public const string BadFormat =
        "Не поддерживаемое форматирование! Возможно, вы используете цитаты, но они пока не поддерживаются. Уберите цитаты и повторите попытку.";

    public const string CaptionTooLong =
        "Подпись к медиафайлу слишком длинная! Максимальная длина подписи — 1022 символов. Сократите пост и пришлите его ещё раз.";

    public const string MessageTooLong =
        "Текст слишком длинный! Максимальная длина поста — 4095 символов. Сократите пост и пришлите его ещё раз.";

    public const string FileTooHeavy =
        "Файл слишком большой для обработки. Пожалуйста, отправьте файл меньшего размера.";

    public const string EmptyTextError =
        "Ошибка: текст поста не может быть пустым или слишком коротким (минимум 2 символа). Пожалуйста, добавьте текст и попробуйте снова.";

    public const string AddButtonQuestion = "Добавить кнопку?";
    public const string WriteButtonText = "Введите текст для кнопки";
    
    public const string WriteAliasForPost = "Теперь придумайте метку для этого поста (слово или число для поиска и идентификации)";
    public const string PostTitleEmptyError = "Метка креатива не может быть пустой. Попробуйте снова.";
    public const string TitleTooLongError = "❌Слишком длинная метка (более 30 символов). Попробуйте снова, но короче.";
    public const string BadSymbolsError = "❌Метка содержит недопустимые символы.\n" +
                                            "Разрешены буквы (латиница, кириллица), цифры и пробелы.";

    public const string AdPostDeleted = "Креатив удалён!";

    public const string ChannelNotFound = "Канал не найден в базе данных.";

    private const string AutoApproveIsEnabled =
        "✅ **Автоприём заявок:** ВКЛЮЧЕН. Задержка {0} минут.";

    public static string AutoApproveEnabled(long minutes) => string.Format(AutoApproveIsEnabled, minutes);

    public const string AutoApproveDisabled = "❌ **Автоприём заявок:** ВЫКЛЮЧЕН.";
    public const string AutoApproveWasDisabled = "✅ Автоприём заявок отключён.";

    public const string WriteNewLabel = "Введите новую метку (одно слово не длиннее 15 символов, без #$!().)";

    private const string AdminInfoTemplate = "📊 Статистика для {0}:\n\n" +
                                     "💸 Сумма закупов: {1} руб.\n" +
                                     "📈 Средняя цена закупа: {2} руб.\n" +
                                     "📅 Добавлен: {3}\n" +
                                     "🔢 Количество закупов: {4}\n";

    public static string AdminInfo(string adminKey, decimal totalSum, decimal averagePrice, string addDateFormatted,
        long zakupsCount)
    {
        return string.Format(AdminInfoTemplate, adminKey, totalSum, averagePrice, addDateFormatted, zakupsCount);
    }

    public const string BotIsNotAdminError =
        "Бот не администратор в этом канале. Добавьте его как администратора и попробуйте ещё раз.";

    public const string BotIsNotMemberError =
        "Бот не участник этого канала. Убедитесь, что добавили меня в качестве администратора и попробуйте ещё раз.";

    public const string MessageForwardedFromBotError =
        "Вы переслали сообщение от бота. Пожалуйста, перешлите сообщение из канала.";

    public const string ForwardPostFromChannelRequest = "Перешлите сюда пост из канала, куда вы меня добавили";
    public const string CantSendFileError = "Извините, произошла ошибка при отправке файла. Пожалуйста, обратитесь к администратору.";
    
    public static readonly HelpMessageTemplate Help = new HelpMessageTemplate();
}

public  class HelpMessageTemplate
{
    public const string ChooseQuestion = "Выберите интересующий вас вопрос из списка ниже:";

    public const string ForWhatBot = "Для чего бот?";

    public const string ForWhatBotResponse =
        "👋Привет, бот ещё *проходит обкатку*, поэтому каждое замечание по работе или пожелание для нас на вес золота!\n" +
        "\n" +
        "\"Вот правда: что-то не понимаете или не работает — *напишите на @gandalfTG*" +
        "\n" +
        "Пару минут вашего времени поможет сделать сервис лучше. *Обещаю, если нюанс важный — приступим к доработке сразу же.* Если нужно будет — созвонимся с вами и всё расскажем, бесплатно!" +
        "\n" +
        "Также вы можете найти описание функций в новостном канале сервиса — https://t.me/easyzakup";
    
    
    public const string HowToCreateZakup = "Как создать размещение?";
    public const string HowToCreateZakupResponse = "⚠️ Раздел находится на технических работах. Весь функционал описан тут https://t.me/easyzakup";

    public const string HowToTrackResult = "Как отслеживать результат?";
    public const string HowToTrackResultResponse = "⚠️ Раздел находится на технических работах. Весь функционал описан тут https://t.me/easyzakup";

    public const string HowToTrackLead = "Отслеживание лидов";
    public const string HowToTrackLeadResponse = "⚠️ Раздел находится на технических работах. Весь функционал описан тут https://t.me/easyzakup";
    public const string HelpAnOffer = "Публичная оферта";
    public const string AnotherQuestion = "Другой вопрос";
    public const string AnotherQuestionResponse = "Напишите на @gandalftg и мы ответим на все ваши вопросы";
    
   
    //Важно соблюдать индексы вопросов и ответов
    public readonly List<string> Questions = new List<string>{ForWhatBot, HowToCreateZakup, HowToTrackResult, HowToTrackLead, AnotherQuestion};
    public readonly List<string> Responses = new List<string>{ForWhatBotResponse, HowToCreateZakupResponse, HowToTrackResultResponse, HowToTrackLeadResponse, AnotherQuestionResponse};
}